<?php
require_once 'header.php' ;


?>
           
         <!-- ***************************************************************************************** -->
         <br>
         <br>
         <br>
         <br>
         <br>
         <br>


         <div class="rastt">
<p>محصول شما با موفقیت به سبد خرید افزوده شد</p>
</div>



          <!-- ***************************************************************************************** -->

        
          <?php
require_once 'footer.php' ;
?>



