-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Jun 20, 2020 at 08:46 PM
-- Server version: 10.4.10-MariaDB
-- PHP Version: 7.3.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `shop`
--

-- --------------------------------------------------------

--
-- Table structure for table `akhbars`
--

DROP TABLE IF EXISTS `akhbars`;
CREATE TABLE IF NOT EXISTS `akhbars` (
  `id_khabar` int(11) NOT NULL AUTO_INCREMENT,
  `ax_khabar` varchar(255) DEFAULT NULL,
  `tozih` text NOT NULL,
  PRIMARY KEY (`id_khabar`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `akhbars`
--

INSERT INTO `akhbars` (`id_khabar`, `ax_khabar`, `tozih`) VALUES
(1, './ak/ax1.jpg', 'به گزارش بولتن نیوز به نقل از دیجیکالا مگ، وان پلاس در بین شرکت‌های تولید کننده گوشی هوشمند، جز آن دسته‌ای قرار دارد که در بخش نمایشگر فوق‌العاده عمل می‌کند. به همین خاطر طبیعی است علاقه‌مندان به بازی‌های ویدئویی به این گوشی نیز روی خوش نشان دهند.\r\n\r\nدر حال حاضر تنها بازی‌های محدودی هستند که با رفرش‌ریت ۹۰ یا ۱۲۰ هرتز اجرا می‌شوند اما به نظر می‌رسد فورتنایت نیز به جمع آن‌ها پیوسته. در همین راستا وان پلاس با اپیک گیمز وارد همکاری شد تا پرچم‌داران جدید و قدرتمندش یعنی وان پلاس ۸ و ۸ پرو اولین محصولاتی لقب بگیرند که این عنوان را روی رفرش ریت ۹۰ هرتز اجرا می‌کنند. یعنی اجرای فورتنایت در وان پلاس ۸ و برادر بزرگ‌ترش در حال حاضر با کیفیت بسیار بالایی صورت می‌گیرد که حتی برخی از محصولات فعلی توان آن را ندارند.\r\n\r\nبسیاری از گوشی‌ها تنها قادر هستند بازی‌هایی نظیر فورتنایت را با رفرش ریت ۳۰ یا نهایتا ۶۰ هرتز تجربه کنند ولی حالا اوضاع بسیار بهتر شده و لذت انجام یکی از پرطرفدارترین بازی‌های بتل رویال دوچندان خواهد شد. همینطور با این کار اپیک گیمز به خوبی توانست به کاربران ثابت کند تا چه اندازه برای گیمرهای موبایل اهمیت قائل است.\r\n\r\nدر حال حاضر برای اجرای فورتنایت با رفرش ریت ۹۰ هرتز و بالاتر به آیپد پرو یا یک کامپیوتر نیاز خواهید داشت چون حتی کنسول‌های نسل فعلی نیز در اجرای این بازی در چنین میزان از رفرش ریت با مشکل مواجه می‌شوند.\r\n\r\nالبته گوشی‌هایی نظیر سری وان پلاس ۷ و ۷T با اینکه از نمایشگرهایی با رفرش ریت ۹۰ هرتز بهره می‌برند اما برای اجرای فورتنایت به رفرش ریت ۶۰ هرتز محدود می‌شوند که امیدواریم در آینده این مسئله تغییر کند. اگر از برنامه وان پلاس Game Space استفاده می‌کنید، می‌توانید فورتنایت را از همان طریق دانلود و نصب کرده و از اجرای آن در بالاترین کیفیت ممکن لذت ببرید.\r\n\r\nوان پلاس ۸ پرو به عنوان قدرتمندترین گوشی وان پلاس از ۱۲ گیگابایت رم LPDDR5 و پردازنده بسیار قدرتمند اسنپدراگون ۸۶۵ بهره می‌برد که خب از چنین سخت‌افزار قدرتمندی می‌توان انتظار بالایی در اجرای بازی‌ها داشت.\r\n\r\nباید این را هم در نظر گرفت انجام بازی در چنین نرخ بالایی نیازمند یک باتری بسیار قدرتمند و انرژی بالاست و خب باید مشکلاتی از قبیل داغ شدن گوشی و تخلیه سریع باتری را نیز به جان خرید. از طرفی در هر شرایطی و تقریبا هرجا که دسترسی به اینترنت فراهم باشد می‌توان این عنوان را با کیفیت خوبی تجربه کرد. با در نظر گرفتن این موارد، به نظر شما اجرای فورتنایت در وان پلاس ۸ و ۸ پرو در رفرش ریت ۹۰ هرتز لذت بخش خواهد بود '),
(2, './ak/ax2.jpg', 'زمانی که اپیک گیمز از عنوان بتل رویال خود رونمایی کرد کمتر کسی تصور می کرد این بازی به این سطح از محبوبیت برسد. نزدیک به 3 سال از زمان انتشار فورتنایت برای رنج وسیعی از پلتفرم ها می گذرد و این عنوان پرطرفدار همچنان روی بورس است. رشد فورتنایت باعث شده صدها میلیون کاربر در سراسر جهان هر روزه این بازی را انجام دهند. در حالی که اپیک گیمز، ناشر این بازی هیچ گاه تا پیش از این تعداد بازیکنان آن را به صورت عمومی اعلام نکرده بود، به تازگی این کمپانی اعلام کرده تا امروز بیش از 350 میلیون کاربر در فورتنایت ثبت نام کرده اند.\r\nطبق اعلام اپیک گیمز، در ماه آوریل بازیکنان بیش از 3.2 میلیارد ساعت وقت صرف بازی فورتنایت کرده اند. بسیاری از کاربران سفت و سخت، صدها ساعت وقت برای این بازی گذاشته اند. استریمرها از جمله این کاربران هستند. با این حال این مدت زمان فقط برای یک ماه، جالب توجه است. این آمار طبیعتا نشان گر تعداد بازیکنان اصلی این بازی نیست و مشخص نیست تعداد کاربران فعال و ثابت چقدر است چرا که طبیعتا بازیکنانی که یک بار بعد از ثبت نام وارد بازی شده اند نیز به حساب آمده اند. حتی اگر اولین بار بسیاری از آنها، آخرین بار نیز بوده است.\r\nاما در هر صورت این تنها آمار رسمی اعلام شده توسط اپیک گیمز از این بازی است. فورتنایت تا همینجا هم که در این مدت زمان طولانی، محبوبیت خود را حفظ کرده و حتی محبوب تر از قبل شده، رکورد خیره کننده ای را به ثبت رسانده است و باید دید تا چه زمانی می تواند به این روند بسیار خوب خود ادامه دهد. اما مسلما به این زودی ها فورتنایت از چشم طرفداران نخواهد افتاد.'),
(3, './ak/ax3.jpg', 'فورتنایت که مدت خیلی زیادی از انتشار رسمی آن نمی‌گذرد، همواره جزو برترین بازی‌های ویدئویی سبک بتل رویال بوده است و روند روبه‌روشدش را همچنان ادامه می‌دهد. باوجود فرازونشیب‌های زیادی که این بازی در دوران عملکرد خود تجربه کرده، این بازی همچنان با نوآوری‌های و اشاره‌های متعدد به مجموعه‌فیلم‌ها و...، جایگاه ویژه‌ای در میان جامعه بازیکنان ازآنِ خود کرده است. سازنده‌ی فورتنایت همچنین سعی کرده با استفاده از محبوبیت ستاره‌های دنیای موسیقی پاپ،‌ کاربران بیشتری را به تجربه‌ی بازی‌اش ترغیب کند.\r\nبازی Fortnite در پلتفرم‌های مختلف ازجمله گوشی‌های هوشمند مبتنی‌بر سیستم‌عامل اندروید در‌دسترس است. این بازی ‌هنگام انتشار روی فروشگاه بزرگ پلی‌استور دردسترس قرار نگرفت؛ اما براساس بیانیه‌ای جدید، به‌نظر می‌رسد بالاخره قرار است به پلی‌استور بیاید.\r\nاپیک گیمز (Epic Games) بیانیه‌ای دراختیار رسانه‌ی پالی‌گان قرار داده و در آن، تأیید کرده است که قصد دارد بازی شوتر محبوب خود را به فروشگاه Google Play Store بیاورد. قبل از این تصمیم و بعد از مخالفت گوگل با کاهش درصد سود دریافتی خود از محل درآمدهای این بازی، اپیک سعی کرد با راه‌اندازی اپلیکیشن و لانچر اختصاصی خود به‌نوعی مستقل از گوگل عمل کند. بااین‌حال، به‌نظر می‌رسد این اقدام آن‌طور که باید و شاید، موفقیت‌آمیز واقع نبوده و این شرکت تصمیم گرفته است در مواضع خود تجدیدنظر کند. البته از روی لحن این بیانیه می‌توان متوجه شد این تصمیم با نهایت نارضایتی اتخاذ شده است. درضمن، شرکت سازنده اعلام کرده درادامه به پشتیبانی از اپلیکیشن اختصاصی خود نیز ادامه خواهد داد.\r\nعد از گذشت ۱۸ ماه از عملیاتی‌کردن فرایند انتشار Fortnite در خارج از بستر گوگل پلی‌استور اندروید، به نتیجه‌گیری اساسی رسیدیم: گوگل با ترفندها و اختیاراتش، نرم‌افزارهایی که خارج از بستر Google Play منتشر می‌شوند، با ضرر و زیان اجتناب‌ناپذیر مواجه می‌کند. این کار ازطریق برخی اقدامات فنی و تجاری برنامه‌ریزی‌شده ازقبیل نمایش مستمر پاپ‌آپ‌های امنیتی ترسناک و تکراری در زمان دانلود و به‌روزرسانی این نرم‌افزارها یا محدودکردن توافقات و قراردادهای تولیدکنندگان با شرکت‌های ارائه‌کننده‌ی خدمات اینترنتی انجام می‌شود. روابط‌عمومی گوگل، منابع ارائه‌کننده‌ی نرم‌افزارهای متفرقه (ترد پارتی) را در فهرست بدافزارهای امنیتی دسته‌بندی می‌کند و با استفاده از پروتکل‌های امنیتی خود، نرم‌افزارهایی را مسدود می‌کند که خارج از بستر گوگل‌پلی دریافت می‌شوند.\r\nبنابه دلایلی که تشریح شد، تصمیم گرفتیم Fortnite را در گوگل پلی‌استور منتشر کنیم. ما همچنان به فعالیت اپلیکیشن Epic Games و بازی فورتنایت در خارج از بستر گوگل پلی ادامه خواهیم داد.'),
(4, './ak/ax4.jpg', 'یکی از فاش کنندگان اطلاعات بازی فورتنایت به نام ShiinaBR به تازگی جزئیات قابل استنادی از نقشه ی بدون جنگ این بازی را که با اسم رمز « Papaya» نامگذاری شده منتشر کرده بود که حالا به نظر می رسد این خبر توسط Epic تأیید شده است.\r\nاپیک گیمز حالت جدید و بدون مبارزه بازی فورتنایت را Party Mode نامگذاری کرده و در ایمیلی که به وبسایت های تولید محتوا از قبیل PC Gamer ارسال کرده، به تشریح جزئیات آن پرداخته است. اپیک در توضیحات خود از این حالت به عنوان «یک فضای آزمایشی و درحال توسعه» یاد کرده که بازیکنان می توانند در آن «سلاح ها و تیم های خود را رها کرده و به کارهای دیگری بپردازند.»\r\nدر ادامه ی این متن به آزمایش عملی این حالت در تاریخ یکم ماه مِی، جمعه ی این هفته رأس ساعت ۱۷ به وقت ایران اشاره شده است. البته برخی از کاربران این بازی از جمله FireMonkey گزارش دادند که این حالت در برخی مناطق از همین الان در دسترس قرار گرفته است. اضافه شدن این حالت می تواند آغازی برای توسعه ی اهداف جدید و متفاوت توسعه دهندگان این بازی برای فورتنایت باشد.\r\nدر خبری که ساعاتی قبل از انتشار این ایمیل منتشر شده بود، به شایعه ی اضافه شدن یک جزیره جدید در نقشه بازی اشاره می شد. ShiinaBR که یکی از فاش کنندگان شناخته شده ی اطلاعات بازی Fortnite در توییتر است، در پست جدید خود بخش هایی از توضیحات توسعه دهندگان این بازی در رابطه نقشه ی جدید Papaya که به جای بتل رویال، Party Royale نامگذاری شده را منتشر کرده بود. در بخش هایی از این متن می خوانیم:\r\nبه «Party» خوش آمدید! سلاح ها و تجهیزات خود را رها کرده و با دوستان خود به گردش، خوش گذرانی و تجربه ی بازی های کوچک این بخش بپردازید. این مهمانی تازه شروع شده است!\r\nنقشه ی جدید این حالت که ظاهراً یک جزیره جداگانه و مستقل است، با اسم رمز «Papaya» نامگذاری شده و مانند نسخه ی کوچکتری از جزیره اصلی و بتل رویال بازی به نظر می رسد. ...'),
(5, './ak/ax5.jpg', 'دوشنبه بود که رویداد The Device بازی فورتنایت چپتر 2 برگزار شد. در جریان این رویداد، دستگاه مخصوص کاراکتر میداس پس از قرار گرفتن در میان زمین و آسمان، امواج مختلفی را تولید کرد که حاصل این امواج، انتقال بازیکنان به یک جهان موازی دیگر بود؛ جایی‌که در یک اداره قرار گرفته بودید و به‌نظر می‌رسید شخصیت‌ها روی تغییرات جهان فعلی نظارت می‌کنند. در انتها پس از بازگشت نهایی به جهان فورتنایت، شاهد یک سونامی بسیار بزرگ بودیم که کل نقشه بازی را فرا گرفته بود.\r\n\r\nپس از گذشت دو روز، فصل سوم از چپتر دوم بازی Fortnite با نام Splash Down در دسترس قرار گرفته است و در این فصل، شاهد تغییرات بسیاری روی نقشه هستیم. تغییرات بازی فقط به نقشه جدید ختم نمی‌شود و مکانیسم‌های تازه‌ای هم به گیم‌پلی فورتنایت اضافه شده است که در ادامه نگاهی به آن‌ها خواهیم انداخت.\r\nتغییرات کلی بازی به چه شکل است؟\r\nپس از آپدیت بازی و ورود به آن، ویدیو سینمایی فصل سوم را مشاهده خواهید کرد. در جریان ویدیو سینمایی فصل سوم از چپتر دوم فورتنایت، نقشه بازی را می‌بینیم که بخش اعظم آن در آب فرو رفته است. ازاین‌رو اولین و بزرگ‌ترین تغییر این فصل، تبدیل شدن نقشه بازی به یک محیط دریایی بزرگ با تعدادی خشکی است. همچنین کوسه‌ها، تغییر دیگر بازی به‌حساب می‌آیند. در محیط‌های کوسه‌ها در حال شنا کردن هستند و باید حواس خود را جمع کنید، زیرا تشنه ربودن آیتم‌های شما هستند. ازاین‌رو اگر درکنار یک آیتم دراپ شده باشند، به‌راحتی آن را می‌ربایند یا به شما حمله خواهند کرد. همچنین بازیکنان می‌توانند از کوسه‌ها به‌عنوان یک وسیله نقلیه هم استفاده کنند. تنها کافی است چوب ماهیگیری داشته باشید و آن را به نقطه پرتاب کنید که یک کوسه در حالت شنا کردن است. ازاین‌رو می‌توانید به‌واسطه‌ی کوسه‌ی مورد نظر، محیط آبی بازی را طی کنید. در فصل دوم، Henchmen به بازی اضافه شد که توسط هوش مصنوعی هدایت می‌شدند. در فصل سوم هم اپیک گیمز (Epic Games) مورد جدیدی را به بازی اضافه کرده که Marauder نام دارد. Marauderها درواقع شبیه‌به دزدان دریایی هستند که سعی می‌کنند پیشرفت شما در بازی را سخت کنند. البته اشاره کنم که Henchmen همچنان در بازی وجود دارد و می‌توانید آن‌ها را در بخش‌هایی مثل نزدیکی مخروبه The Agency مشاهده کنید.');

-- --------------------------------------------------------

--
-- Table structure for table `mahsols`
--

DROP TABLE IF EXISTS `mahsols`;
CREATE TABLE IF NOT EXISTS `mahsols` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(150) NOT NULL,
  `price` int(11) NOT NULL,
  `ax` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

--
-- Dumping data for table `mahsols`
--

INSERT INTO `mahsols` (`id`, `name`, `price`, `ax`) VALUES
(16, 'Bandle Fallen Love Ranger', 350000, './mi/x16.jpg'),
(15, 'MINTY PICKAXE ', 400000, './mi/x15.jpg'),
(14, 'Bandle Ikonik', 250000, './mi/x14.jpg'),
(13, 'Bandle HONOR Guard', 650000, './mi/x13.jpg'),
(12, 'Bandle Neo Versa', 130000, './mi/x12.jpg'),
(11, 'Bandle Geforce', 800000, './mi/x11.jpg'),
(10, 'Battle pass', 155000, './mi/x10.jpg'),
(9, 'Save the world(d)', 500000, './mi/x9.jpg'),
(8, 'Save the world(s)', 345000, './mi/x8.jpg'),
(7, '13500 vbucks', 1300000, './mi/x7.jpg'),
(5, '2800 vbucks', 379000, './mi/x5.jpg'),
(6, '5000 vbucks', 550000, './mi/x6.jpg'),
(4, '1000 vbucks', 155000, './mi/x4.jpg'),
(3, 'Bandle Deep Freaze', 580000, './mi/x3.jpg'),
(2, 'Starter pack', 89000, './mi/x2.jpg'),
(1, 'Bandle psycho', 150000, './mi/x1.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `phone` varchar(11) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `epic_name` varchar(255) DEFAULT NULL,
  `2fa` tinyint(4) DEFAULT 0,
  `password` varchar(255) NOT NULL,
  PRIMARY KEY (`phone`),
  KEY `email` (`email`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`phone`, `email`, `epic_name`, `2fa`, `password`) VALUES
('09101468218', 'test@test.com', NULL, 0, '$2y$10$/RZSCnddYB1sKUYA0Gr0Ie9vVETh7pXyV630fnozhpEzRSZ5e4zM.'),
('09191173802', 'test2@test.com', NULL, 0, '$2y$10$wx3ojHdacY/Gk8heho9O0.Xzv7GQOiNC9LSoYpO56RAZz2282rFze'),
('0912345', 'test4@test.com', NULL, 0, '$2y$10$DfdCOCDLteQk.Neot5IbOOy868Qk3SNbkKDf1Y8lTJ5J3eEbBLZhG'),
('09123456', 'test5@test.com', NULL, 0, '$2y$10$42Xk2CC7drhor/f7wvrR0.4NFteSPVEiUM5PYt4rayz6zK.1i2SSa'),
('09121212', 'test6@test.com', NULL, 0, '$2y$10$2TbTVXwco0Y0ejg9VJ2hlOa5CwITcqFIKeDaIApbBj6ZicpQdqPIO');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
